#현재 위치 경로를 출력
pwd

#현재위치에서 파일 및 폴더 조회
ls

#목록조회 자세히
ls -l

#목록조회 자세히, 숨김파일까지
ls -al (자주 쓰는는)

#목록조회 자세히, 숨김파일, 오래된 순으로 정렬 (최신은 alt)
ls -alrt (종종 쓰는, a - all , l - list , r - reverse , t - time ,  => 시간순으로 뒤집는다.)

#디렉토리 생성
mkdir jinnn_dir => 현재 위치에서 디렉토리 생성

# 특정 디렉토리로 이동
cd jinnn_dir (상대경로)

# 상위 디렉토리 이동
'cd ..' / 또는 'cd../'


# 루트 디렉토리로 이동 (최상위 디렉토리)
'cd /'

# 직전 폴더(뒤로가기)로 이동
'cd -'

# home(/home/본인계정) 경로로 이동
cd

# 상대경로와 절대경로
# 상대경로 : cd ../../
# 절대경로 : cd /home (아 나 홈으로 갈래 ㅋ)

#

mkdir " " -> (make directory, " " 디렉토리를 만든다.)

.. => 상위 폴더를 의미함
- => 직전폴더로 감